SpenceKonde/DxCore/megaavr/boards.txt
##########################################################################
#                                                                        #
#  #######              #####                                            #
#  ##    ##            ##```                                             #
#  ##     ## ##   ##   ##      ###  ####  ####     ##      ##      ###   #
#  ##     ##  ## ##    ##     #   # #   # #       ###     #       #  #   #
#  ##     ##   ###     ##     #   # ####  ###      ##     ###       #    #
#  ##    ##   ## ##    ##___  #   # # #   #        ##  ## #  # ##  #     #
#  #######   ##   ##    #####  ###  #  #  ####    #### ##  ##  ## ####   #
#________________________________________________________________________#
#                                                                        #
#  Copyright Spence Konde and other contributors 2020-2021               #
#  Based on megaTinyCore which in turn is based on official Arduino core #
#  Varying portions of different files in this core can be traced back   #
#  to the official core. In any event, it's all free software, under the #
#  (LGPL v2.1) see LICENSE.md and License section of README.md           #
#________________________________________________________________________#
#                                                                        #
#  Now reformatted for easy navigation with text editing tools which     #
#  have the zoomed out view that you can scroll through.                 #
#  The board section headings have a triangle along the right edge       #
#  if they are a non-bootloader definition.                              #
#________________________________________________________________________#
#                                                                        #
#                   ####   ###   ###  ####  ####   ###                   #
#                   #   # #   # #   # #   # #   # #                      #
#                   ####  #   # ##### ####  #   #  ###                   #
#                   #   # #   # #   # #  #  #   #     #                  #
#                   ####   ###  #   # #   # ####   ###                   #
#________________________________________________________________________#
#                                                                        #
# Names listed at the top so they can be kept in consistent format.      #
# Experience has shown that they end up drifting apart in style if       #
# they aren't all on the same screen                                     #
#                                                                        #
# DA128 shipped Q1 2020. DA64 and DA32 shipped Q3/4 2020 (Q3 DA32's did  #
# not work correctly). First sign in radical changes to branding.        #
# DB128 shipped Q2 2020,  32DB shipped Q4 2020. First AVR with on-chip   #
#     OPAMPs.                                                            #
# DD (64k in high pincounts, 16/32 in low ones) shipped in Q2 2022.      #
#     By year's end, all the expected parts were out in at least one     #
#     package, but DIP28 and QFN28 are missing for the small flash parts #
#     as if QFN20, then they are missing for those of the smaller ones   #
#     and QFN20 is missing for 64k (but I don't think it is planned      #
#     Based on the results of my filing the epoxy off the top of ).      #
# EA (first fullsize parts w/diff ADC w/PGA) Shipping march 2023, but    #
#     no ETA on QFN/TQFP 48/32/28 without buying a whole tray.           #
# DU (Dx with native USB) - Yes, you read that right. The 32u4 was looin #
#     pretty damned long in the tooth. It is coming. When? Well, it's    #
#     next in the pipeline after the EA's, and I think they recognize    #
#     how badly the AVR product line needs a native USB product to keep  #
#     people who need it from wandering out of the ecosystem and finding #
#     some other family of parts they like better. The DU's themselves   #
#     are rather less than inspiring. Much has been sacrificed upon the  #
#     altar of USB - 2 pincounts lost a TCB, their TCD was likely        #
#     repurposed to generate that 48 MHz reference clock needed for USB  #
#     2.0 standard. And MVIO went to handling level shifting to 3.3v for #
#     USB According to original product brief they can tune from the USB #
#     signals and achieve usb without a crystal if desired or they can   #
#     use a crystal like any decent person would.                        #
# EB (2 novel timers and little else, beyond low pincounts. This is a    #
#     possible tiny-killer) and not available yet. Likely (hopefully,    #
#     with only one UART!) aimed at a low price point.  It will have the #
#     fancy new ADC - but they can hit a low price range with that       #
#     easily enough, they did so on tiny 2-series - heck, they did it    #
#     with a second UART on a tiny...                                    #
##########################################################################


##########################################################################
#                                                                        #
#             ###  #   # ####  #   # #### #   # #   #  ###               #
#            #     #   # #   # ## ## #    ##  # #   # #                  #
#             ###  #   # ####  # # # ###  # # # #   #  ###               #
#                # #   # #   # #   # #    #  ## #   #     #              #
#             ###   ###  ####  #   # #### #   #  ###   ###               #
#________________________________________________________________________#
# The *opti menus are for Optiboot board definitions - We name them
# differently when the option takes on different meaning for a bootloaded
# board. Eg - UPDI can set fuses, so any fuse that can't brick the chip is written
# And we can assume all fuses have the the values that the user selected.
# But if Optiboot is in use, anything that requires changing a fuse requires burnbootloader
#_________________________________________________________________________

menu.chip=Chip
menu.board=Board/version
menu.clock=Clock Speed
menu.millis=millis()/micros() timer
menu.bodvoltage=BOD level if enabled (Bootload burn req'd)
menu.bodmode=BOD Mode Active/Sleeping (Bootload burn req'd)
menu.WDTtimeout=WDT Timeout (Bootload burn req'd)
menu.WDTwindow=WDT "window" (Bootload burn req'd)
menu.eesave=Save EEPROM
#menu.eesavedd=Save EEPROM (Bootload burn req'd)
menu.resetpin=Reset pin function
#menu.resetupdipins=Reset and UPDI (Bootload burn req'd)
menu.resetupdipinsopti=Reset and UPDI (Bootload burn req'd)
menu.startuptime=Startup Time
menu.startuptimeopti=Startup Time (Bootload burn req'd)
menu.bootloaderusart=Bootloader Serial Port (Bootload burn req'd)
menu.bootloaderusartdd=Bootloader Serial Port (Bootload burn req'd)
menu.entrycond=Bootloader Entry Condition (Bootload burn req'd)
menu.appspm=Write to flash from app
menu.mvio=MultiVoltage I/O (MVIO)
menu.mvioopti=MultiVoltage I/O (MVIO)
menu.attach=attachInterrupt() Version
menu.printf=printf()
menu.wiremode=Wire (Wire.h/I2C) Library mode
menu.flmap=How to set FLMAP: (64k+ parts only)
menu.bootloader-class=Bootloader type (installed by burn + must match 2 upload)

##########################################################################
#                                                                        #
###              ####    ###    ###   ####   ####    ###               ###
#####            #   #  #   #  #   #  #   #  #   #  #                #####
#######          ####   #   #  #####  ####   #   #   ###           #######
#####            #   #  #   #  #   #  #  #   #   #      #            #####
###              ####    ###   #   #  #   #  ####    ###               ###
#________________________________________________________________________#

