SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
avrdd.menu.bodvoltage.1v9=1.9V
avrdd.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdd.menu.bodvoltage.2v45=2.45V
avrdd.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdd.menu.bodvoltage.2v70=2.70V
avrdd.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdd.menu.bodvoltage.2v85=2.85V
avrdd.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdd.menu.bodmode.disabled=Disabled/Disabled
avrdd.menu.bodmode.enabled=Enabled/Enabled
avrdd.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrdd.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrdd.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrdd.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrdd.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrdd.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrdd.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdd.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdd.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdd.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdd.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdd.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdd.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrdd.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdd.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdd.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
avrdd.menu.eesave.enable=EEPROM retained
avrdd.menu.eesave.enable.bootloader.eesavebit=1
avrdd.menu.eesave.disable=EEPROM not retained
avrdd.menu.eesave.disable.bootloader.eesavebit=0


#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
avrdd.menu.resetpin.reset=Hardware Reset (recommended)
avrdd.menu.resetpin.reset.bootloader.resetpinbit=1
avrdd.menu.resetpin.input=Input (no output, ever)
avrdd.menu.resetpin.input.bootloader.resetpinbit=0

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrdd.menu.millis.tcbhighest=Default (recommended)
avrdd.menu.millis.disabled=Disabled (delay() only)
avrdd.menu.millis.tcb0=TCB0
avrdd.menu.millis.tcb1=TCB1 (default for 14/20 pins)
avrdd.menu.millis.tcb2=TCB2 (default for 28/32 pins)
avrdd.menu.millis.tca0=TCA0
avrdd.menu.millis.tcbhighest.build.millistimer={build.highestcb}
avrdd.menu.millis.tcb0.build.millistimer=B0
avrdd.menu.millis.tcb1.build.millistimer=B1
avrdd.menu.millis.tcb2.build.millistimer=B2
avrdd.menu.millis.tca0.build.millistimer=A0
avrdd.menu.millis.rtc=RTC internal osc (no micros)
avrdd.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal, no micros
avrdd.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
avrdd.menu.millis.rtc.build.millistimer=RTC_OSC
avrdd.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
avrdd.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avrdd.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrdd.menu.printf.default=Default, 1.5k flash, no floats
avrdd.menu.printf.full=Full, 2.6k, prints floats
avrdd.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdd.menu.printf.full.build.printfabr=.pfF
avrdd.menu.printf.minimal=Minimal, 1.1k flash used
avrdd.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdd.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#avrdd.menu.optimization.size=-Os (size)
#avrdd.menu.optimization.sizegcse=-Os (size, no GCSE)
#avrdd.menu.optimization.o3=-O3 (speed)
#avrdd.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#avrdd.menu.optimization.size.build.optimizationlevel=-Os
#avrdd.menu.optimization.sizegcse.build.optimizationlevel=-Os
#avrdd.menu.optimization.o3.build.optimizationlevel=-O3
#avrdd.menu.optimization.o3gcse.build.optimizationlevel=-O3
#avrdd.menu.optimization.size.build.optabr=.Os
#avrdd.menu.optimization.sizegcse.build.optabr=.Osng
#avrdd.menu.optimization.o3.build.optabr=.O3
#avrdd.menu.optimization.o3gcse.build.optabr=.O3ng
#avrdd.menu.optimization.sizegcse.build.gcse=-fno-gcse
#avrdd.menu.optimization.o3gcse.build.gcse=-fno-gcse


#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrdd.menu.attach.allenabled=On all pins, with new implementation.
avrdd.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrdd.menu.attach.manual=Only enabled ports. Please see documentation.
avrdd.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrdd.menu.attach.oldversion=Old version, may fix bugs.
avrdd.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrdd.menu.attach.manual.build.attachabr=.aMan
avrdd.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# MVIO menu                              #
#________________________________________#
avrdd.menu.mvio.enabled=Enabled
avrdd.menu.mvio.enabled.bootloader.mviobits=01
avrdd.menu.mvio.enabled.build.mvioenable=-DMVIO_ENABLED
avrdd.menu.mvio.disabled=Disabled
avrdd.menu.mvio.disabled.bootloader.mviobits=10
avrdd.menu.mvio.disabled.build.mvioenable=

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrdd.menu.startuptime.8=8ms
avrdd.menu.startuptime.0=0ms
avrdd.menu.startuptime.1=1ms
avrdd.menu.startuptime.2=2ms
avrdd.menu.startuptime.4=4ms
avrdd.menu.startuptime.16=16ms
avrdd.menu.startuptime.32=32ms
avrdd.menu.startuptime.64=64ms
avrdd.menu.startuptime.0.bootloader.sutbits=000
avrdd.menu.startuptime.1.bootloader.sutbits=001
avrdd.menu.startuptime.2.bootloader.sutbits=010
avrdd.menu.startuptime.4.bootloader.sutbits=011
avrdd.menu.startuptime.8.bootloader.sutbits=100
avrdd.menu.startuptime.16.bootloader.sutbits=101
avrdd.menu.startuptime.32.bootloader.sutbits=110
avrdd.menu.startuptime.64.bootloader.sutbits=111

#-------------------------------------#
#         Wire Mode Selection         #
#     To enable master+slave mode     #
#_____________________________________#
avrdd.menu.wiremode.mors= Master or Slave
avrdd.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrdd.menu.wiremode.mors.build.wireabr=.wO
avrdd.menu.wiremode.mands=Master and Slave
avrdd.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrdd.menu.wiremode.mands.build.wireabr=.wA

#-------------------------------------#
#         SPM from app mode           #
# To enable writing flash from app    #
#_____________________________________#
avrdd.menu.appspm.no=Disabled (Always use this if not writing flash from app)
avrdd.menu.appspm.no.bootloader.appspm=
avrdd.menu.appspm.no.bootloader.BOOTSIZE=0x00
avrdd.menu.appspm.no.build.appspmabr=
avrdd.menu.appspm.full=Anywhere after 0x0200 (warning: App allowed to overwrite itself)
avrdd.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
avrdd.menu.appspm.full.build.appspmabr=.spmALL
avrdd.menu.appspm.8plus=Above 8k (meant for 16k parts)
avrdd.menu.appspm.8plus.bootloader.appspm=-DSPM_FROM_APP=16
avrdd.menu.appspm.8plus.bootloader.CODESIZE=16
avrdd.menu.appspm.12plus=Above 12k (meant for 16k parts)
avrdd.menu.appspm.12plus.bootloader.appspm=-DSPM_FROM_APP=24
avrdd.menu.appspm.12plus.bootloader.CODESIZE=24
avrdd.menu.appspm.14plus=Above 14k (meant for 16k parts)
avrdd.menu.appspm.14plus.bootloader.appspm=-DSPM_FROM_APP=28
avrdd.menu.appspm.14plus.bootloader.CODESIZE=28
avrdd.menu.appspm.16plus=Above 16k (AVR64/32 only, meant for 32k parts)
avrdd.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=32
avrdd.menu.appspm.16plus.bootloader.CODESIZE=32
avrdd.menu.appspm.24plus=Above 24k (AVR64/32 only, meant for 32k parts)
avrdd.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=48
avrdd.menu.appspm.24plus.bootloader.CODESIZE=48
avrdd.menu.appspm.28plus=Above 28k (AVR64/32 only, meant for 32k parts)
avrdd.menu.appspm.28plus.bootloader.appspm=-DSPM_FROM_APP=56
avrdd.menu.appspm.28plus.bootloader.CODESIZE=56
avrdd.menu.appspm.32plus=Above 32k (AVR64 only)
avrdd.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=64
avrdd.menu.appspm.32plus.bootloader.CODESIZE=64
avrdd.menu.appspm.48plus=Above 48k (AVR64 only)
avrdd.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=96
avrdd.menu.appspm.48plus.bootloader.CODESIZE=96
avrdd.menu.appspm.56plus=Above 56k (AVR64 only)
avrdd.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=112
avrdd.menu.appspm.56plus.bootloader.CODESIZE=112
avrdd.menu.appspm.60plus=Above 60k (AVR64 only)
avrdd.menu.appspm.60plus.bootloader.appspm=-DSPM_FROM_APP=120
avrdd.menu.appspm.60plus.bootloader.CODESIZE=120


