SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrdu.menu.WDTtimeout.disabled=Disabled (recommended)
avrdu.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrdu.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrdu.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrdu.menu.WDTtimeout.1second=Window remains open for 1 Second
avrdu.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrdu.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrdu.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrdu.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrdu.menu.WDTwindow.disabled=No delay before window "opens"
avrdu.menu.WDTwindow.8seconds=8 Second before window "opens"
avrdu.menu.WDTwindow.4seconds=4 Second before window "opens"
avrdu.menu.WDTwindow.2seconds=2 Second before window "opens"
avrdu.menu.WDTwindow.1second=1 Second before window "opens"
avrdu.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrdu.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrdu.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrdu.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrdu.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrdu.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrdu.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrdu.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrdu.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrdu.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrdu.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrdu.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrdu.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrdu.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrdu.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrdu.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrdu.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrdu.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrdu.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrdu.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrdu.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrdu.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
avrdu.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
avrdu.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
avrdu.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
avrdu.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
avrdu.menu.flmap.unlocked.build.flmapopts=
avrdu.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
avrdu.menu.flmap.lockdefault.build.flmapabr=.fld
avrdu.menu.flmap.unlocked.build.flmapabr=.ful
avrdu.menu.flmap.locksection0.build.flmapabr=.fl0


##########################################################################
#                                                                        #
###                 ###  #     # ####      #####   ###                 ###
#####              #   # #     # #   #     #      #   #              #####
#######            #####  #   #  ####  ### ####   #####            #######
#####              #   #   # #   #  #      #      #   #              #####
###                #   #    #    #   #     #####  #   #                ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for EA parts   #
#________________________________________#
avrea.build.board=avrea
avrea.build.core=dxcore
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
avrea.build.f_cpu={build.speed}000000L
avrea.build.text_section_start=.text=0x0
avrea.build.extra_flags=
avrea.build.export_merged_output=false
avrea.build.printf=
avrea.build.flmapopts=
avrea.build.millistimer=B2

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrea.bootloader.tool=avrdude
avrea.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
# AVR Ex-series can only take either 0 (20 MHz) or 8 (16 MHz). overridden when 16 MHz used.
avrea.bootloader.oschffrq=0
avrea.bootloader.OSCCFG=0b0000{bootloader.oschffrq}000
avrea.bootloader.wdtwindowbits=0000
avrea.bootloader.wdttimeotbits=0000
avrea.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrea.bootloader.updipinbit=1
avrea.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbit}00{bootloader.eesavebit}
avrea.bootloader.CODESIZE=0x00
avrea.bootloader.BOOTSIZE=0x00
avrea.bootloader.avrdudestring=
avrea.bootloader.pymcuprogstring=-aerase
avrea.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
avrea.bootloader.serupdifuse5=5:{bootloader.SYSCFG0}
#----------------------------------------#
# Upload and programming                 #
#________________________________________#
avrea.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
avrea.program.serupdifuse5=5:{bootloader.SYSCFG0}
avrea.upload.tool=avrdude
avrea.upload.prog_interlock=
avrea.upload.maximum_size=0
avrea.upload.maximum_data_size=0
#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrea.build.mcupostfix=
avrea.build.printfabr=
avrea.build.flmapabr=.ful
avrea.build.attachabr=
avrea.build.wireabr=
##Not supported but still need empty string here.
avrea.build.appspmabr=

