SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avreb.menu.WDTtimeout.disabled=Disabled (recommended)
avreb.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avreb.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avreb.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avreb.menu.WDTtimeout.1second=Window remains open for 1 Second
avreb.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avreb.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avreb.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avreb.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avreb.menu.WDTwindow.disabled=No delay before window "opens"
avreb.menu.WDTwindow.8seconds=8 Second before window "opens"
avreb.menu.WDTwindow.4seconds=4 Second before window "opens"
avreb.menu.WDTwindow.2seconds=2 Second before window "opens"
avreb.menu.WDTwindow.1second=1 Second before window "opens"
avreb.menu.WDTwindow.500msec=500 millisecond before window "opens"
avreb.menu.WDTwindow.250msec=250 millisecond before window "opens"
avreb.menu.WDTwindow.125msec=125 millisecond before window "opens"
avreb.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avreb.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avreb.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avreb.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avreb.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avreb.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avreb.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avreb.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avreb.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avreb.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avreb.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avreb.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avreb.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avreb.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avreb.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avreb.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avreb.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avreb.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avreb.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
avreb.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
avreb.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
avreb.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
avreb.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
avreb.menu.flmap.unlocked.build.flmapopts=
avreb.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
avreb.menu.flmap.lockdefault.build.flmapabr=.fld
avreb.menu.flmap.unlocked.build.flmapabr=.ful
avreb.menu.flmap.locksection0.build.flmapabr=.fl0

##########################################################################
#                                                                        #
################    ###  #     # ####      #####   ###    ################
#####              #   # #     # #   #     #      #   #              #####
################   #####  #   #  ####  ### ####   #       ################
#####              #   #   # #   # #       #      #   #              #####
################   #   #    #    #  #      #####   ###    ################
#________________________________________________________________________#
#                                        #
# Parameters and defaults for EC parts   #
# pending availability of information    #
#________________________________________#

##########################################################################
#                                                                        #
###                 ###  #     # ####      #       ###                 ###
################   #   # #     # #   #     #      #   #   ################
#######            #####  #   #  ####  ### #      #####            #######
################   #   #   # #   # #       #      #   #   ################
###                #   #    #    #  #      #####  #   #                ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for LA parts   #
# pending availability of information    #
#________________________________________#

##########################################################################
#                                                                        #
#   ###  #     # ####      ####   ###            ###          #          #
#  #   # #     # #   #     #   # #   #          #   #        ###  ##     #
#  #####  #   #  ####  ### #   # #####          #   #  ###    #          #
#  #   #   # #   # #       #   # #   #          #   #  #  #   #   ##     #
#  #   #    #    #  #      ####  #   #           ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #             #
# Parameters and defaults for DA parts   #
#________________________________________#
avrdaopti.build.board=avrda
avrdaopti.build.core=dxcore
avrdaopti.upload.maximum_size=0
avrdaopti.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
avrdaopti.build.f_cpu={build.speed}000000L
avrdaopti.build.text_section_start=.text=0x200
avrdaopti.build.extra_flags= -DSERIAL_PORT_BOOT={bootloader.portname} -DSERIAL_PORT_BOOT_PORTMUX={bootloader.portswap} -DUSING_OPTIBOOT
avrdaopti.build.export_merged_output=true
avrdaopti.build.printf=
avrdaopti.build.flmapopts=
avrdaopti.build.attachmode=-DCORE_ATTACH_ALL
avrdaopti.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
avrdaopti.bootloader.serupdifuse5=5:{bootloader.SYSCFG0}
avrdaopti.program.serupdifuse5=5:{bootloader.SYSCFG0}
avrdaopti.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrdaopti.bootloader.tool=avrdude
avrdaopti.bootloader.defaultentrycond=_extrf
avrdaopti.bootloader.entrycond={bootloader.defaultentrycond}
avrdaopti.bootloader.file={runtime.platform.path}/bootloaders/hex/{bootloader.class}{bootloader.port}{bootloader.entrycond}.hex
avrdaopti.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
# AVR Dx-series can only take either 1 (unsupported, 32 kHz, too slow for serial, and 1/30th of the minimum speed we support) or 0 (normal operation)
avrdaopti.bootloader.OSCCFG=0b00000000
avrdaopti.bootloader.wdtwindowbits=0000
avrdaopti.bootloader.wdttimeotbits=0000
avrdaopti.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdaopti.bootloader.SYSCFG0=0b1100{bootloader.resetpinbit}000
avrdaopti.bootloader.CODESIZE=0x00
avrdaopti.bootloader.BOOTSIZE=0x01
avrdaopti.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
avrdaopti.bootloader.pymcuprogstring=-f "{bootloader.file}" -a write

