SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Reset pin as INPUT, UPDI as I/O        #
#________________________________________#
avrddopti.menu.resetupdipinsopti.resetupdi=PF6: Reset & PF7: UPDI (typical, recommended)
avrddopti.menu.resetupdipinsopti.resetupdi.bootloader.defaultentrycond=_extr
avrddopti.menu.resetupdipinsopti.resetupdi.bootloader.resetpinbit=1
avrddopti.menu.resetupdipinsopti.resetupdi.bootloader.updipinbit=1
avrddopti.menu.resetupdipinsopti.inputupdi=PF6: Input & PF7: UPDI (no challenges)
avrddopti.menu.resetupdipinsopti.inputupdi.bootloader.defaultentrycond=_all_8sec
avrddopti.menu.resetupdipinsopti.inputupdi.bootloader.resetpinbit=0
avrddopti.menu.resetupdipinsopti.inputupdi.bootloader.updipinbit=1
avrddopti.menu.resetupdipinsopti.resetgpio=PF6: Reset & PF7: GPIO  (Danger! HV required)
avrddopti.menu.resetupdipinsopti.resetgpio.bootloader.defaultentrycond=_extr
avrddopti.menu.resetupdipinsopti.resetgpio.bootloader.resetpinbit=1
avrddopti.menu.resetupdipinsopti.resetgpio.bootloader.updipinbit=0
avrddopti.menu.resetupdipinsopti.inputgpio=PF6: Input & PF7: GPIO  (Danger! HV required)
avrddopti.menu.resetupdipinsopti.inputgpio.bootloader.defaultentrycond=_all_8sec
avrddopti.menu.resetupdipinsopti.inputgpio.bootloader.resetpinbit=0
avrddopti.menu.resetupdipinsopti.inputgpio.bootloader.updipinbit=0

#----------------------------------------#
# Optiboot Entry Conditions              #
#________________________________________#
avrddopti.menu.entrycond.default=Default (see documentation)
avrddopti.menu.entrycond.extr=External (reset pin) (see documentation)
avrddopti.menu.entrycond.extronly=External reset only (see documentation)
avrddopti.menu.entrycond.all=Always (see documentation)
avrddopti.menu.entrycond.poronly= Power On Only (see documentation)
avrddopti.menu.entrycond.swr=SW-only (see documentation)
avrddopti.menu.entrycond.extr_slow=External (reset pin), slow (see documentation)
avrddopti.menu.entrycond.default.bootloader.entrycond={bootloader.defaultentrycond}
avrddopti.menu.entrycond.extr.bootloader.entrycond=_extr
avrddopti.menu.entrycond.extronly.bootloader.entrycond=_extronly
avrddopti.menu.entrycond.poronly.bootloader.entrycond=_poronly_8sec
avrddopti.menu.entrycond.all.bootloader.entrycond=_all_8sec
avrddopti.menu.entrycond.swr.bootloader.entrycond=_swronly_8sec
avrddopti.menu.entrycond.extr_slow.bootloader.entrycond=_extr_8sec

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrddopti.menu.millis.tcbhighest=TCB2 on 28/32pin else TCB1 (recommended)
avrddopti.menu.millis.disabled=Disabled (delay() only)
avrddopti.menu.millis.tcb0=TCB0
avrddopti.menu.millis.tcb1=TCB1 (Default on 20/14 pin parts)
avrddopti.menu.millis.tca0=TCA0
avrddopti.menu.millis.tca0.build.millistimer=A0
avrddopti.menu.millis.tcbhighest.build.millistimer={build.highestcb}
avrddopti.menu.millis.tcb0.build.millistimer=B0
avrddopti.menu.millis.tcb1.build.millistimer=B1
avrddopti.menu.millis.tcb2.build.millistimer=B2
avrddopti.menu.millis.tca0.build.millistimer=A0
#avrddopti.menu.millis.tcd0.build.millistimer=D0
avrddopti.menu.millis.rtc=RTC internal osc (no micros)
avrddopti.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal, no micros
avrddopti.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
avrddopti.menu.millis.rtc.build.millistimer=RTC_OSC
avrddopti.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
avrddopti.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avrddopti.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrddopti.menu.printf.default=Default, 1.5k flash, no floats
avrddopti.menu.printf.full=Full, 2.6k, prints floats
avrddopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrddopti.menu.printf.full.build.printfabr=.pfF
avrddopti.menu.printf.minimal=Minimal, 1.1k flash used. Save ~400b
avrddopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrddopti.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#avrddopti.menu.optimization.size=-Os (size)
#avrddopti.menu.optimization.sizegcse=-Os (size, no GCSE)
#avrddopti.menu.optimization.o3=-O3 (speed)
#avrddopti.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#avrddopti.menu.optimization.size.build.optimizationlevel=-Os
#avrddopti.menu.optimization.sizegcse.build.optimizationlevel=-Os
#avrddopti.menu.optimization.o3.build.optimizationlevel=-O3
#avrddopti.menu.optimization.o3gcse.build.optimizationlevel=-O3
#avrddopti.menu.optimization.size.build.optabr=.Os
#avrddopti.menu.optimization.sizegcse.build.optabr=.Osng
#avrddopti.menu.optimization.o3.build.optabr=.O3
#avrddopti.menu.optimization.o3gcse.build.optabr=.O3ng
#avrddopti.menu.optimization.sizegcse.build.gcse=-fno-gcse
#avrddopti.menu.optimization.o3gcse.build.gcse=-fno-gcse


#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrddopti.menu.attach.allenabled=On all pins, with new implementation.
avrddopti.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrddopti.menu.attach.manual=Only enabled ports. Please see documentation.
avrddopti.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrddopti.menu.attach.manual.build.attachabr=.aMan
avrddopti.menu.attach.oldversion=Old version, may fix bugs.
avrddopti.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrddopti.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# MVIO                                   #
#________________________________________#
avrddopti.menu.mvioopti.enabled=Enabled
avrddopti.menu.mvioopti.enabled.bootloader.mviobits=01
avrddopti.menu.mvioopti.enabled.build.mvioenable=-DMVIO_ENABLED
avrddopti.menu.mvioopti.disabled=Disabled
avrddopti.menu.mvioopti.disabled.bootloader.mviobits=10
avrddopti.menu.mvioopti.disabled.build.mvioenable=
avrddopti.menu.mvioopti.reallyenabled=Enabled, "burn bootloader" done for sure.
avrddopti.menu.mvioopti.reallyenabled.bootloader.mviobits=01
avrddopti.menu.mvioopti.reallyenabled.build.mvioenable=-DMVIO_ENABLED -DASSUME_MVIO_FUSE
avrddopti.menu.mvioopti.reallydisabled=Disabled, "burn bootloader" done for sure.
avrddopti.menu.mvioopti.reallydisabled.bootloader.mviobits=10
avrddopti.menu.mvioopti.reallydisabled.build.mvioenable=-DASSUME_MVIO_FUSE



