SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrddopti.menu.startuptime.8=8ms
avrddopti.menu.startuptime.0=0ms
avrddopti.menu.startuptime.1=1ms
avrddopti.menu.startuptime.2=2ms
avrddopti.menu.startuptime.4=4ms
avrddopti.menu.startuptime.16=16ms
avrddopti.menu.startuptime.32=32ms
avrddopti.menu.startuptime.64=64ms
avrddopti.menu.startuptime.0.bootloader.sutbits=000
avrddopti.menu.startuptime.1.bootloader.sutbits=001
avrddopti.menu.startuptime.2.bootloader.sutbits=010
avrddopti.menu.startuptime.4.bootloader.sutbits=011
avrddopti.menu.startuptime.8.bootloader.sutbits=100
avrddopti.menu.startuptime.16.bootloader.sutbits=101
avrddopti.menu.startuptime.32.bootloader.sutbits=110
avrddopti.menu.startuptime.64.bootloader.sutbits=111

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrddopti.menu.wiremode.mors=1x Wire, Master or Slave
avrddopti.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrddopti.menu.wiremode.mors.build.wireabr=.wO
avrddopti.menu.wiremode.mands=1x Wire, Master and Slave
avrddopti.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrddopti.menu.wiremode.mands.build.wireabr=.wA


#----------------------------------------#
# Optiboot serial port                   #
#________________________________________#
avrddopti.menu.bootloaderusart.ser0=USART0 (default pins): TX PA0, RX PA1 (int. clock only)
avrddopti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrddopti.menu.bootloaderusart.ser0.bootloader.portname=Serial
avrddopti.menu.bootloaderusart.ser0.bootloader.portswap=0
avrddopti.menu.bootloaderusart.ser0_alt1=USART0 (alt1): TX PA4, RX PA5 (20+ pin only)
avrddopti.menu.bootloaderusart.ser0_alt1.bootloader.port=_ser0_alt1
avrddopti.menu.bootloaderusart.ser0_alt1.bootloader.portname=Serial
avrddopti.menu.bootloaderusart.ser0_alt1.bootloader.portswap=1
avrddopti.menu.bootloaderusart.ser0_alt2=USART0 (alt2): TX PA2, RX PA3 (20+ pin only)
avrddopti.menu.bootloaderusart.ser0_alt2.bootloader.port=_ser0_alt2
avrddopti.menu.bootloaderusart.ser0_alt2.bootloader.portname=Serial
avrddopti.menu.bootloaderusart.ser0_alt2.bootloader.portswap=2
avrddopti.menu.bootloaderusart.ser0_alt3=USART0 (alt3): TX PD4, RX PD5
avrddopti.menu.bootloaderusart.ser0_alt3.bootloader.port=_ser0_alt3
avrddopti.menu.bootloaderusart.ser0_alt3.bootloader.portname=Serial
avrddopti.menu.bootloaderusart.ser0_alt3.bootloader.portswap=3
avrddopti.menu.bootloaderusart.ser0_alt4=USART0 (alt4): TX PC1, RX PC2
avrddopti.menu.bootloaderusart.ser0_alt4.bootloader.port=_ser0_alt4
avrddopti.menu.bootloaderusart.ser0_alt4.bootloader.portname=Serial
avrddopti.menu.bootloaderusart.ser0_alt4.bootloader.portswap=4
avrddopti.menu.bootloaderusart.ser1=USART1: TX PC0, RX PC1 (28/32 pin only)
avrddopti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrddopti.menu.bootloaderusart.ser1.bootloader.portname=Serial1
avrddopti.menu.bootloaderusart.ser1.bootloader.portswap=0
avrddopti.menu.bootloaderusart.ser1_alt2=USART1 (alt2): TX PD6, RX PD7 (14pin LED on PD4)
avrddopti.menu.bootloaderusart.ser1_alt2.bootloader.port=_ser1_alt2
avrddopti.menu.bootloaderusart.ser1_alt2.bootloader.portname=Serial1
avrddopti.menu.bootloaderusart.ser1_alt2.bootloader.portswap=2
avrddopti.menu.bootloaderusart.ser1_alt2.altled=-DLED_BUILTIN=PIN_PD4

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrddopti.menu.WDTtimeout.disabled=Disabled (recommended)
avrddopti.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrddopti.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrddopti.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrddopti.menu.WDTtimeout.1second=Window remains open for 1 Second
avrddopti.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrddopti.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrddopti.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrddopti.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrddopti.menu.WDTwindow.disabled=No delay before window "opens"
avrddopti.menu.WDTwindow.8seconds=8 Second before window "opens"
avrddopti.menu.WDTwindow.4seconds=4 Second before window "opens"
avrddopti.menu.WDTwindow.2seconds=2 Second before window "opens"
avrddopti.menu.WDTwindow.1second=1 Second before window "opens"
avrddopti.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrddopti.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrddopti.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrddopti.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrddopti.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrddopti.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrddopti.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrddopti.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrddopti.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrddopti.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrddopti.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrddopti.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrddopti.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrddopti.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrddopti.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrddopti.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrddopti.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrddopti.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrddopti.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrddopti.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrddopti.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrddopti.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
avrddopti.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
avrddopti.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
avrddopti.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
avrddopti.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
avrddopti.menu.flmap.unlocked.build.flmapopts=
avrddopti.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
avrddopti.menu.flmap.lockdefault.build.flmapabr=.fld
avrddopti.menu.flmap.unlocked.build.flmapabr=.ful
avrddopti.menu.flmap.locksection0.build.flmapabr=.fl0


##########################################################################
#                                                                        #
#   ###  #     # ####      #####   ###           ###          #          #
#  #   # #     # #   #     #      #   #         #   #        ###  ##     #
#  #####  #   #  ####  ### ####   #####         #   #  ###    #          #
#  #   #   # #   # #       #      #   #         #   #  #  #   #   ##     #
#  #   #    #    #  #      #####  #   #          ###   ###    #   ##     #
#______________________________________________________#_________________#

#avrea.bootloader.oschffrq=0
#avrea.bootloader.OSCCFG=0b0000{bootloader.oschffrq}000

avreaopti.build.board=avrea
avreaopti.build.core=dxcore
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
avreaopti.build.f_cpu={build.speed}000000L
avreaopti.build.text_section_start=.text=0x200
avreaopti.build.extra_flags= -DSERIAL_PORT_BOOT={bootloader.portname} -DSERIAL_PORT_BOOT_PORTMUX={bootloader.portswap} -DUSING_OPTIBOOT
avreaopti.build.export_merged_output=false
avreaopti.build.printf=
avreaopti.build.flmapopts=
avreaopti.build.millistimer=B2

