SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avreaopti.bootloader.tool=avrdude
avreaopti.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
# AVR Ex-series can only take either 0 (20 MHz) or 8 (16 MHz). overridden when 16 MHz used.
avreaopti.bootloader.oschffrq=0
avreaopti.bootloader.OSCCFG=0b0000{bootloader.oschffrq}000
avreaopti.bootloader.wdtwindowbits=0000
avreaopti.bootloader.wdttimeotbits=0000
avreaopti.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avreaopti.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbit}00{bootloader.eesavebit}
avreaopti.bootloader.CODESIZE=0x00
avreaopti.bootloader.BOOTSIZE=0x02
avreaopti.bootloader.avrdudestring=
avreaopti.bootloader.pymcuprogstring=-aerase
avreaopti.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
avreaopti.bootloader.supdidudefuse5=5:{bootloader.SYSCFG0}

#----------------------------------------#
# Upload parameters for Optiboot         #
#________________________________________#
avreaopti.upload.tool=avrdude
avreaopti.upload.protocol=arduino
avreaopti.upload.extra_params=-D
avreaopti.upload.speed=115200
avreaopti.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avreaopti.build.mcupostfix=
avreaopti.build.printfabr=
avreaopti.build.flmapabr=.ful
avreaopti.build.attachabr=
avreaopti.build.wireabr=
##Not supported but still need empty string here.
avreaopti.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-EA submenu options                     #
#____________________________________________#
# Chip (memory and pincount)            #
#_______________________________________#
avreaopti.menu.chip.avr64ea28=AVR64EA28
avreaopti.menu.chip.avr64ea28.build.mcu=avr64ea28
avreaopti.menu.chip.avr64ea28.upload.maximum_size=65536
avreaopti.menu.chip.avr64ea28.upload.maximum_data_size=8192
avreaopti.menu.chip.avr64ea28.build.variant=28pin-easeries
avreaopti.menu.chip.avr64ea32=AVR64EA32
avreaopti.menu.chip.avr64ea32.build.mcu=avr64ea32
avreaopti.menu.chip.avr64ea32.upload.maximum_size=65536
avreaopti.menu.chip.avr64ea32.upload.maximum_data_size=8192
avreaopti.menu.chip.avr64ea32.build.variant=32pin-easeries
avreaopti.menu.chip.avr64ea48=AVR64EA48
avreaopti.menu.chip.avr64ea48.build.mcu=avr64ea48
avreaopti.menu.chip.avr64ea48.upload.maximum_size=65536
avreaopti.menu.chip.avr64ea48.upload.maximum_data_size=8192
avreaopti.menu.chip.avr64ea48.build.variant=48pin-easeries
avreaopti.menu.chip.avr32ea28=AVR32EA28
avreaopti.menu.chip.avr32ea28.build.mcu=avr32ea28
avreaopti.menu.chip.avr32ea28.upload.maximum_size=32768
avreaopti.menu.chip.avr32ea28.upload.maximum_data_size=4096
avreaopti.menu.chip.avr32ea28.build.variant=28pin-easeries
avreaopti.menu.chip.avr32ea32=AVR32EA32
avreaopti.menu.chip.avr32ea32.build.mcu=avr32ea32
avreaopti.menu.chip.avr32ea32.upload.maximum_size=32768
avreaopti.menu.chip.avr32ea32.upload.maximum_data_size=4096
avreaopti.menu.chip.avr32ea32.build.variant=32pin-easeries
avreaopti.menu.chip.avr32ea48=AVR32EA48
avreaopti.menu.chip.avr32ea48.build.mcu=avr32ea48
avreaopti.menu.chip.avr32ea48.upload.maximum_size=32768
avreaopti.menu.chip.avr32ea48.upload.maximum_data_size=4096
avreaopti.menu.chip.avr32ea48.build.variant=48pin-easeries
avreaopti.menu.chip.avr16ea28=AVR16EA28
avreaopti.menu.chip.avr16ea28.build.mcu=avr16ea28
avreaopti.menu.chip.avr16ea28.upload.maximum_size=16384
avreaopti.menu.chip.avr16ea28.upload.maximum_data_size=2048
avreaopti.menu.chip.avr16ea28.build.variant=28pin-easeries
avreaopti.menu.chip.avr16ea32=AVR16EA32
avreaopti.menu.chip.avr16ea32.build.mcu=avr16ea32
avreaopti.menu.chip.avr16ea32.upload.maximum_size=16384
avreaopti.menu.chip.avr16ea32.upload.maximum_data_size=2048
avreaopti.menu.chip.avr16ea32.build.variant=32pin-easeries
avreaopti.menu.chip.avr16ea48=AVR16EA48
avreaopti.menu.chip.avr16ea48.build.mcu=avr16ea48
avreaopti.menu.chip.avr16ea48.upload.maximum_size=16384
avreaopti.menu.chip.avr16ea48.upload.maximum_data_size=2048
avreaopti.menu.chip.avr16ea48.build.variant=48pin-easeries

#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
avreaopti.menu.clock.20internal=20 MHz internal
avreaopti.menu.clock.20internal.build.speed=20
avreaopti.menu.clock.20internal.build.clocksource=0
avreaopti.menu.clock.16internal=16 MHz internal
avreaopti.menu.clock.16internal.build.speed=16
avreaopti.menu.clock.16internal.build.clocksource=0
avreaopti.menu.clock.16internal.bootloader.oschffrq=1
avreaopti.menu.clock.10internal=10 MHz internal
avreaopti.menu.clock.10internal.build.speed=10
avreaopti.menu.clock.10internal.build.clocksource=0
avreaopti.menu.clock.8internal=8 MHz internal
avreaopti.menu.clock.8internal.build.speed=8
avreaopti.menu.clock.8internal.build.clocksource=0
avreaopti.menu.clock.8internal.bootloader.oschffrq=1
avreaopti.menu.clock.5internal=5 MHz internal
avreaopti.menu.clock.5internal.build.speed=5
avreaopti.menu.clock.5internal.build.clocksource=0
avreaopti.menu.clock.4internal=4 MHz internal
avreaopti.menu.clock.4internal.build.speed=4
avreaopti.menu.clock.4internal.build.clocksource=0
avreaopti.menu.clock.4internal.bootloader.oschffrq=1
avreaopti.menu.clock.1internal=1 MHz internal
avreaopti.menu.clock.1internal.build.speed=1
avreaopti.menu.clock.1internal.build.clocksource=0
avreaopti.menu.clock.1internal.bootloader.oschffrq=1
avreaopti.menu.clock.20crystal=20 MHz crystal
avreaopti.menu.clock.20crystal.build.speed=20
avreaopti.menu.clock.20crystal.build.clocksource=1
avreaopti.menu.clock.16crystal=16 MHz crystal
avreaopti.menu.clock.16crystal.build.speed=16
avreaopti.menu.clock.16crystal.build.clocksource=1
avreaopti.menu.clock.12crystal=12 MHz crystal
avreaopti.menu.clock.12crystal.build.speed=12
avreaopti.menu.clock.12crystal.build.clocksource=1
avreaopti.menu.clock.8crystal=8 MHz crystal
avreaopti.menu.clock.8crystal.build.speed=8
avreaopti.menu.clock.8crystal.build.clocksource=1
avreaopti.menu.clock.20extclock=20 MHz ext. clock
avreaopti.menu.clock.20extclock.build.speed=20
avreaopti.menu.clock.20extclock.build.clocksource=2
avreaopti.menu.clock.16extclock=16 MHz ext. clock
avreaopti.menu.clock.16extclock.build.speed=16
avreaopti.menu.clock.16extclock.build.clocksource=2
avreaopti.menu.clock.12extclock=12 MHz ext. clock
avreaopti.menu.clock.12extclock.build.speed=12
avreaopti.menu.clock.12extclock.build.clocksource=2
avreaopti.menu.clock.8extclock=8 MHz ext. clock
avreaopti.menu.clock.8extclock.build.speed=8
avreaopti.menu.clock.8extclock.build.clocksource=2
avreaopti.menu.clock.24crystal=24 MHz crystal (overclocked)
avreaopti.menu.clock.24crystal.build.speed=24
avreaopti.menu.clock.24crystal.build.clocksource=1
avreaopti.menu.clock.25crystal=25 MHz crystal (overclocked)
avreaopti.menu.clock.25crystal.build.speed=25
avreaopti.menu.clock.25crystal.build.clocksource=1
avreaopti.menu.clock.27crystal=27 MHz crystal (overclocked)
avreaopti.menu.clock.27crystal.build.speed=27
avreaopti.menu.clock.27crystal.build.clocksource=1
avreaopti.menu.clock.28crystal=28 MHz crystal (overclocked)
avreaopti.menu.clock.28crystal.build.speed=28
avreaopti.menu.clock.28crystal.build.clocksource=1
avreaopti.menu.clock.30crystal=30 MHz crystal (way overclocked)
avreaopti.menu.clock.30crystal.build.speed=30
avreaopti.menu.clock.30crystal.build.clocksource=1
avreaopti.menu.clock.32crystal=32 MHz crystal (way overclocked)
avreaopti.menu.clock.32crystal.build.speed=32
avreaopti.menu.clock.32crystal.build.clocksource=1
#avreaopti.menu.clock.36crystal=36 MHz crystal (unlikely-to-work overclocked)
#avreaopti.menu.clock.36crystal.build.speed=36
#avreaopti.menu.clock.36crystal.build.clocksource=1
#avreaopti.menu.clock.40crystal=40 MHz crystal (unlikely-to-work overclocked)
#avreaopti.menu.clock.40crystal.build.speed=40
#avreaopti.menu.clock.40crystal.build.clocksource=1
avreaopti.menu.clock.24extclock=24 MHz ext. clock (overclocked)
avreaopti.menu.clock.24extclock.build.speed=24
avreaopti.menu.clock.24extclock.build.clocksource=2
avreaopti.menu.clock.25extclock=25 MHz ext. clock (overclocked)
avreaopti.menu.clock.25extclock.build.speed=25
avreaopti.menu.clock.25extclock.build.clocksource=2
avreaopti.menu.clock.27extclock=27 MHz ext. clock (overclocked)
avreaopti.menu.clock.27extclock.build.speed=27
avreaopti.menu.clock.27extclock.build.clocksource=2
avreaopti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avreaopti.menu.clock.28extclock.build.speed=28
avreaopti.menu.clock.28extclock.build.clocksource=2
avreaopti.menu.clock.30extclock=30 MHz ext. clock (wayoverclocked)
avreaopti.menu.clock.30extclock.build.speed=30
avreaopti.menu.clock.30extclock.build.clocksource=2
avreaopti.menu.clock.32extclock=32 MHz ext. clock (way overclocked)
avreaopti.menu.clock.32extclock.build.speed=32
avreaopti.menu.clock.32extclock.build.clocksource=2
#avreaopti.menu.clock.36extclock=36 MHz ext. clock (unlikely-to-work overclocked)
#avreaopti.menu.clock.36extclock.build.speed=36
#avreaopti.menu.clock.36extclock.build.clocksource=2
#avreaopti.menu.clock.40extclock=40 MHz ext. clock (unlikely-to-work overclocked)
#avreaopti.menu.clock.40extclock.build.speed=40
#avreaopti.menu.clock.40extclock.build.clocksource=2

