SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) option        #
#________________________________________#
#    Completely speculative         #
#   Assumes same as Dx-series       #
#___________________________________#
avreaopti.menu.bodvoltage.1v75=1.75V (during programming only)
avreaopti.menu.bodvoltage.1v75.bootloader.bodlevbits=000
avreaopti.menu.bodvoltage.1v9=1.9V
avreaopti.menu.bodvoltage.1v9.bootloader.bodlevbits=001
avreaopti.menu.bodvoltage.2v6=2.60V
avreaopti.menu.bodvoltage.2v6.bootloader.bodlevbits=010
avreaopti.menu.bodvoltage.4v3=4.3V
avreaopti.menu.bodvoltage.4v3.bootloader.bodlevbits=011
avreaopti.menu.bodmode.disabled=Disabled/Disabled
avreaopti.menu.bodmode.enabled=Enabled/Enabled
avreaopti.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avreaopti.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avreaopti.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avreaopti.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avreaopti.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avreaopti.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avreaopti.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avreaopti.menu.bodmode.disabled.bootloader.BODCFG=0x00
avreaopti.menu.bodmode.enabled.bootloader.bodmodebits=00101
avreaopti.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avreaopti.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avreaopti.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avreaopti.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avreaopti.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avreaopti.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avreaopti.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
avreaopti.menu.eesave.enable=EEPROM retained
avreaopti.menu.eesave.enable.bootloader.eesavebit=1
avreaopti.menu.eesave.disable=EEPROM not retained
avreaopti.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# Reset pin as INPUT, UPDI as I/O        #
#________________________________________#
avreaopti.menu.resetupdipins.resetupdi=PF6: Reset & PF7: UPDI (typical and recommended)
avreaopti.menu.resetupdipins.resetupdi.bootloader.resetpinbit=1
avreaopti.menu.resetupdipins.resetupdi.bootloader.updipinbit=1
avreaopti.menu.resetupdipins.inputupdi=PF6: Input & PF7: UPDI (no challenges)
avreaopti.menu.resetupdipins.inputupdi.bootloader.resetpinbit=0
avreaopti.menu.resetupdipins.inputupdi.bootloader.updipinbit=1
avreaopti.menu.resetupdipins.resetgpio=PF6: Reset & PF7: GPIO (Danger! HV required)
avreaopti.menu.resetupdipins.resetgpio.bootloader.resetpinbit=1
avreaopti.menu.resetupdipins.resetgpio.bootloader.updipinbit=0
avreaopti.menu.resetupdipins.inputgpio=PF6: Input & PF7: GPIO (Danger! HV required)
avreaopti.menu.resetupdipins.inputgpio.bootloader.resetpinbit=0
avreaopti.menu.resetupdipins.inputgpio.bootloader.updipinbit=0

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avreaopti.menu.millis.tcb2=TCB2 (recommended)
avreaopti.menu.millis.disabled=Disabled
avreaopti.menu.millis.tcb0=TCB0
avreaopti.menu.millis.tcb1=TCB1
avreaopti.menu.millis.tcb3=TCB3
avreaopti.menu.millis.tca0=TCA0
avreaopti.menu.millis.tca1=TCA1
avreaopti.menu.millis.rtc=RTC internal osc (no micros)
avreaopti.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal, no micros
avreaopti.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
avreaopti.menu.millis.tcb0.build.millistimer=B0
avreaopti.menu.millis.tcb1.build.millistimer=B1
avreaopti.menu.millis.tcb2.build.millistimer=B2
avreaopti.menu.millis.tcb3.build.millistimer=B3
avreaopti.menu.millis.tca0.build.millistimer=A0
avreaopti.menu.millis.tca1.build.millistimer=A1
avreaopti.menu.millis.rtc.build.millistimer=RTC_OSC
avreaopti.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
avreaopti.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avreaopti.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avreaopti.menu.printf.default=Default, 1.5k flash, no floats
avreaopti.menu.printf.full=Full, 2.6k, prints floats
avreaopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avreaopti.menu.printf.full.build.printfabr=.pfF
avreaopti.menu.printf.minimal=Minimal, 1.1k flash used
avreaopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avreaopti.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#avreaopti.menu.optimization.size=-Os (size)
#avreaopti.menu.optimization.sizegcse=-Os (size, no GCSE)
#avreaopti.menu.optimization.o3=-O3 (speed)
#avreaopti.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#avreaopti.menu.optimization.size.build.optimizationlevel=-Os
#avreaopti.menu.optimization.sizegcse.build.optimizationlevel=-Os
#avreaopti.menu.optimization.o3.build.optimizationlevel=-O3
#avreaopti.menu.optimization.o3gcse.build.optimizationlevel=-O3
#avreaopti.menu.optimization.size.build.optabr=.Os
#avreaopti.menu.optimization.sizegcse.build.optabr=.Osng
#avreaopti.menu.optimization.o3.build.optabr=.O3
#avreaopti.menu.optimization.o3gcse.build.optabr=.O3ng
#avreaopti.menu.optimization.sizegcse.build.gcse=-fno-gcse
#avreaopti.menu.optimization.o3gcse.build.gcse=-fno-gcse


#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avreaopti.menu.attach.allenabled=On all pins, with new implementation.
avreaopti.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avreaopti.menu.attach.manual=Only enabled ports. Please see documentation.
avreaopti.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avreaopti.menu.attach.oldversion=Old version, may fix bugs.
avreaopti.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avreaopti.menu.attach.manual.build.attachabr=.aMan
avreaopti.menu.attach.oldversion.build.attachabr=.aOld

