SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Startup time options                   #
#________________________________________#
avreaopti.menu.startuptime.8=8ms
avreaopti.menu.startuptime.0=0ms
avreaopti.menu.startuptime.1=1ms
avreaopti.menu.startuptime.2=2ms
avreaopti.menu.startuptime.4=4ms
avreaopti.menu.startuptime.16=16ms
avreaopti.menu.startuptime.32=32ms
avreaopti.menu.startuptime.64=64ms
avreaopti.menu.startuptime.0.bootloader.SYSCFG1=0x00
avreaopti.menu.startuptime.1.bootloader.SYSCFG1=0x01
avreaopti.menu.startuptime.2.bootloader.SYSCFG1=0x02
avreaopti.menu.startuptime.4.bootloader.SYSCFG1=0x03
avreaopti.menu.startuptime.8.bootloader.SYSCFG1=0x04
avreaopti.menu.startuptime.16.bootloader.SYSCFG1=0x05
avreaopti.menu.startuptime.32.bootloader.SYSCFG1=0x06
avreaopti.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avreaopti.menu.wiremode.mors=1x Wire, Master or Slave
avreaopti.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avreaopti.menu.wiremode.mors.build.wireabr=.wO
avreaopti.menu.wiremode.mands=1x Wire, Master and Slave
avreaopti.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avreaopti.menu.wiremode.mands.build.wireabr=.wA

#-------------------------------------#
#         SPM from app mode           #
# To enable writing flash from app    #
#_____________________________________#
avreaopti.menu.appspm.no=Disabled (SPM write from app is not yet supported)
avreaopti.menu.appspm.no.bootloader.appspm=
avreaopti.menu.appspm.no.bootloader.BOOTSIZE=0x00
avreaopti.menu.appspm.no.build.appspmabr=
avreaopti.menu.appspm.full=These options don't work,
avreaopti.menu.appspm.full.bootloader.appspm=
avreaopti.menu.appspm.full.build.appspmabr=.spmINVALID
avreaopti.menu.appspm.full.bootloader.BOOTSIZE=0x00
#avreaopti.menu.appspm.full=Anywhere after 0x0200 (warning: App allowed to overwrite itself)
#avreaopti.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
#avreaopti.menu.appspm.full.build.appspmabr=.spmALL
#avreaopti.menu.appspm.8plus=Above 8k (meant for 16k parts)
#avreaopti.menu.appspm.8plus.bootloader.appspm=-DSPM_FROM_APP=32
#avreaopti.menu.appspm.8plus.bootloader.CODESIZE=32
#avreaopti.menu.appspm.12plus=Above 12k (meant for 16k parts)
#avreaopti.menu.appspm.12plus.bootloader.appspm=-DSPM_FROM_APP=48
#avreaopti.menu.appspm.12plus.bootloader.CODESIZE=48
#avreaopti.menu.appspm.14plus=Above 14k (meant for 16k parts)
#avreaopti.menu.appspm.14plus.bootloader.appspm=-DSPM_FROM_APP=56
#avreaopti.menu.appspm.14plus.bootloader.CODESIZE=56
#avreaopti.menu.appspm.16plus=Above 16k (AVR64/32 only, meant for 32k parts)
#avreaopti.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=64
#avreaopti.menu.appspm.16plus.bootloader.CODESIZE=64
avreaopti.menu.appspm.24plus=but they have to be here for tests to run.
avreaopti.menu.appspm.24plus.bootloader.appspm=
#avreaopti.menu.appspm.24plus.bootloader.CODESIZE=96
#avreaopti.menu.appspm.28plus=Above 28k (AVR64/32 only, meant for 32k parts)
#avreaopti.menu.appspm.28plus.bootloader.appspm=-DSPM_FROM_APP=112
#avreaopti.menu.appspm.28plus.bootloader.CODESIZE=112
#avreaopti.menu.appspm.32plus=Above 32k (AVR64 only)
#avreaopti.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=128
#avreaopti.menu.appspm.32plus.bootloader.CODESIZE=128
#avreaopti.menu.appspm.48plus=Above 48k (AVR64 only)
#avreaopti.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=192
#avreaopti.menu.appspm.48plus.bootloader.CODESIZE=192
#avreaopti.menu.appspm.56plus=Above 56k (AVR64 only)
#avreaopti.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=224
#avreaopti.menu.appspm.56plus.bootloader.CODESIZE=224
#avreaopti.menu.appspm.60plus=Above 60k (AVR64 only)
#avreaopti.menu.appspm.60plus.bootloader.appspm=-DSPM_FROM_APP=240
#avreaopti.menu.appspm.60plus.bootloader.CODESIZE=240

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avreaopti.menu.WDTtimeout.disabled=Disabled (recommended)
avreaopti.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avreaopti.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avreaopti.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avreaopti.menu.WDTtimeout.1second=Window remains open for 1 Second
avreaopti.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avreaopti.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avreaopti.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avreaopti.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avreaopti.menu.WDTwindow.disabled=No delay before window "opens"
avreaopti.menu.WDTwindow.8seconds=8 Second before window "opens"
avreaopti.menu.WDTwindow.4seconds=4 Second before window "opens"
avreaopti.menu.WDTwindow.2seconds=2 Second before window "opens"
avreaopti.menu.WDTwindow.1second=1 Second before window "opens"
avreaopti.menu.WDTwindow.500msec=500 millisecond before window "opens"
avreaopti.menu.WDTwindow.250msec=250 millisecond before window "opens"
avreaopti.menu.WDTwindow.125msec=125 millisecond before window "opens"
avreaopti.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avreaopti.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avreaopti.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avreaopti.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avreaopti.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avreaopti.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avreaopti.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avreaopti.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avreaopti.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avreaopti.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avreaopti.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avreaopti.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avreaopti.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avreaopti.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avreaopti.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avreaopti.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avreaopti.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avreaopti.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avreaopti.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

