SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
avreaopti.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
avreaopti.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
avreaopti.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
avreaopti.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
avreaopti.menu.flmap.unlocked.build.flmapopts=
avreaopti.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
avreaopti.menu.flmap.lockdefault.build.flmapabr=.fld
avreaopti.menu.flmap.unlocked.build.flmapabr=.ful
avreaopti.menu.flmap.locksection0.build.flmapabr=.fl0



##########################################################################
#                                                                        #
#   ###  #     # ####      #####  ####           ###          #          #
#  #   # #     # #   #     #      #   #         #   #        ###  ##     #
#  #####  #   #  ####  ### ####   ####          #   #  ###    #          #
#  #   #   # #   # #       #      #   #         #   #  #  #   #   ##     #
#  #   #    #    #  #      #####  ####           ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #
# Parameters and defaults for EB parts   #
#________________________________________#

#avrebopti.bootloader.oschffrq=0
#avrebopti.bootloader.OSCCFG=0b0000{bootloader.oschffrq}000

# Can probably be binary identical with EA's
avrebopti.upload.tool=avrdude
avrebopti.upload.prog_interlock=
avrebopti.build.board=avreb
avrebopti.build.core=dxcore
avrebopti.upload.maximum_size=0
avrebopti.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at lebst a dozen parts with varying memory constraints.
avrebopti.build.f_cpu={build.speed}000000L
avrebopti.build.text_section_start=.text=0x200
avrebopti.build.extra_flags= -DSERIAL_PORT_BOOT={bootloader.portname} -DSERIAL_PORT_BOOT_PORTMUX={bootloader.portswap} -DUSING_OPTIBOOT
avrebopti.build.export_merged_output=false
avrebopti.build.printf=
avrebopti.build.flmapopts=

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrebopti.bootloader.tool=avrdude
avrebopti.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrebopti.bootloader.oschffrq=0
avrebopti.bootloader.OSCCFG=0b0000{bootloader.oschffrq}000
avrebopti.bootloader.wdtwindowbits=0000
avrebopti.bootloader.wdttimeotbits=0000
avrebopti.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrebopti.bootloader.updipinbit=1
avrebopti.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbit}00{bootloader.eesavebit}
avrebopti.bootloader.CODESIZE=0x00
avrebopti.bootloader.BOOTSIZE=0x02
avrebopti.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
avrebopti.bootloader.pymcuprogstring=-f "{bootloader.file}" -a write
avrebopti.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
avrebopti.bootloader.serupdifuse5=5:{bootloader.SYSCFG0}
#----------------------------------------#
# Upload and programming                 #
#________________________________________#
avrebopti.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
avrebopti.program.serupdifuse5=5:{bootloader.SYSCFG0}
avrebopti.upload.tool=avrdude
avrebopti.upload.protocol=arduino
avrebopti.upload.extra_params=-D
avrebopti.upload.speed=115200
avrebopti.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards
avrebopti.upload.maximum_size=0
avrebopti.upload.maximum_data_size=0

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrebopti.build.mcupostfix=opti
avrebopti.build.printfabr=
avrebopti.build.flmapabr=.ful
avrebopti.build.attachabr=
avrebopti.build.wireabr=
##Not supported but still need empty string here.
avrebopti.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-EB submenu options                     #
#____________________________________________#
# Chip (memory and pincount)            #
#_______________________________________#
avrebopti.menu.chip.avr32eb14=AVR32EB14
avrebopti.menu.chip.avr32eb14.build.mcu=avr32eb14
avrebopti.menu.chip.avr32eb14.upload.maximum_size=32768
avrebopti.menu.chip.avr32eb14.upload.maximum_data_size=3072
avrebopti.menu.chip.avr32eb14.build.variant=14pin-ebseries
avrebopti.menu.chip.avr32eb20=AVR32EB20
avrebopti.menu.chip.avr32eb20.build.mcu=avr32eb20
avrebopti.menu.chip.avr32eb20.upload.maximum_size=32768
avrebopti.menu.chip.avr32eb20.upload.maximum_data_size=3072
avrebopti.menu.chip.avr32eb20.build.variant=20pin-ebseries
avrebopti.menu.chip.avr32eb28=AVR32EB28
avrebopti.menu.chip.avr32eb28.build.mcu=avr32eb28
avrebopti.menu.chip.avr32eb28.upload.maximum_size=32768
avrebopti.menu.chip.avr32eb28.upload.maximum_data_size=3072
avrebopti.menu.chip.avr32eb28.build.variant=28pin-ebseries
avrebopti.menu.chip.avr32eb32=AVR32EB32
avrebopti.menu.chip.avr32eb32.build.mcu=avr32eb32
avrebopti.menu.chip.avr32eb32.upload.maximum_size=32768
avrebopti.menu.chip.avr32eb32.upload.maximum_data_size=3072
avrebopti.menu.chip.avr32eb32.build.variant=32pin-ebseries
avrebopti.menu.chip.avr16eb14=AVR16EB14
avrebopti.menu.chip.avr16eb14.build.mcu=avr16eb14
avrebopti.menu.chip.avr16eb14.upload.maximum_size=16384
avrebopti.menu.chip.avr16eb14.upload.maximum_data_size=2048
avrebopti.menu.chip.avr16eb14.build.variant=14pin-ebseries
avrebopti.menu.chip.avr16eb20=AVR16EB20
avrebopti.menu.chip.avr16eb20.build.mcu=avr16eb20
avrebopti.menu.chip.avr16eb20.upload.maximum_size=16384
avrebopti.menu.chip.avr16eb20.upload.maximum_data_size=2048
avrebopti.menu.chip.avr16eb20.build.variant=20pin-ebseries
avrebopti.menu.chip.avr16eb28=AVR16EB28
avrebopti.menu.chip.avr16eb28.build.mcu=avr16eb28
avrebopti.menu.chip.avr16eb28.upload.maximum_size=16384
avrebopti.menu.chip.avr16eb28.upload.maximum_data_size=2048
avrebopti.menu.chip.avr16eb28.build.variant=28pin-ebseries
avrebopti.menu.chip.avr16eb32=AVR16EB32
avrebopti.menu.chip.avr16eb32.build.mcu=avr16eb32
avrebopti.menu.chip.avr16eb32.upload.maximum_size=16384
avrebopti.menu.chip.avr16eb32.upload.maximum_data_size=2048
avrebopti.menu.chip.avr16eb32.build.variant=32pin-ebseries

