SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
avrebopti.menu.clock.20internal=20 MHz internal
avrebopti.menu.clock.20internal.build.speed=20
avrebopti.menu.clock.20internal.build.clocksource=0
avrebopti.menu.clock.16internal=16 MHz internal
avrebopti.menu.clock.16internal.build.speed=16
avrebopti.menu.clock.16internal.build.clocksource=0
avrebopti.menu.clock.16internal.bootloader.oschffrq=1
avrebopti.menu.clock.10internal=10 MHz internal
avrebopti.menu.clock.10internal.build.speed=10
avrebopti.menu.clock.10internal.build.clocksource=0
avrebopti.menu.clock.8internal=8 MHz internal
avrebopti.menu.clock.8internal.build.speed=8
avrebopti.menu.clock.8internal.build.clocksource=0
avrebopti.menu.clock.8internal.bootloader.oschffrq=1
avrebopti.menu.clock.5internal=5 MHz internal
avrebopti.menu.clock.5internal.build.speed=5
avrebopti.menu.clock.5internal.build.clocksource=0
avrebopti.menu.clock.4internal=4 MHz internal
avrebopti.menu.clock.4internal.build.speed=4
avrebopti.menu.clock.4internal.build.clocksource=0
avrebopti.menu.clock.4internal.bootloader.oschffrq=1
avrebopti.menu.clock.1internal=1 MHz internal
avrebopti.menu.clock.1internal.build.speed=1
avrebopti.menu.clock.1internal.build.clocksource=0
avrebopti.menu.clock.1internal.bootloader.oschffrq=1
#avrebopti.menu.clock.20intpll=20 MHz int. w/80Mhz PLL
#avrebopti.menu.clock.20intpll.build.speed=20
#avrebopti.menu.clock.20intpll.build.clocksource=6
#avrebopti.menu.clock.16intpll=16 MHz int. w/64Mhz PLL
#avrebopti.menu.clock.16intpll.build.speed=16
#avrebopti.menu.clock.16intpll.build.clocksource=6
#avrebopti.menu.clock.16intpll.bootloader.oschffrq=1
#avrebopti.menu.clock.10intpll=10 MHz int. w/40Mhz PLL
#avrebopti.menu.clock.10intpll.build.speed=10
#avrebopti.menu.clock.10intpll.build.clocksource=6
#avrebopti.menu.clock.8intpll=8 MHz int. w/32 Mhz PLL
#avrebopti.menu.clock.8intpll.build.speed=8
#avrebopti.menu.clock.8intpll.build.clocksource=6
#avrebopti.menu.clock.8intpll.bootloader.oschffrq=1
#avrebopti.menu.clock.5intpll=5 MHz int. w/20Mhz PLL (??)
#avrebopti.menu.clock.5intpll.build.speed=5
#avrebopti.menu.clock.5intpll.build.clocksource=6
#avrebopti.menu.clock.4intpll=4 MHz int. w/16Mhz PLL (??)
#avrebopti.menu.clock.4intpll.build.speed=4
#avrebopti.menu.clock.4intpll.build.clocksource=6
#avrebopti.menu.clock.4intpll.bootloader.oschffrq=1
#avrebopti.menu.clock.20extpll=20 MHz ext. clock w/80 Mhz PLL
#avrebopti.menu.clock.20extpll.build.speed=20
#avrebopti.menu.clock.20extpll.build.clocksource=10
avrebopti.menu.clock.20extclock=20 MHz ext. clock
avrebopti.menu.clock.20extclock.build.speed=20
avrebopti.menu.clock.20extclock.build.clocksource=2
#avrebopti.menu.clock.16extpll=16 MHz ext. clock w/64 Mhz PLL
#avrebopti.menu.clock.16extpll.build.speed=16
#avrebopti.menu.clock.16extpll.build.clocksource=10
avrebopti.menu.clock.16extclock=16 MHz ext. clock
avrebopti.menu.clock.16extclock.build.speed=16
avrebopti.menu.clock.16extclock.build.clocksource=2
#avrebopti.menu.clock.12extpll=12 MHz ext. clock w/48 Mhz PLL
#avrebopti.menu.clock.12extpll.build.speed=12
#avrebopti.menu.clock.12extpll.build.clocksource=10
avrebopti.menu.clock.12extclock=12 MHz ext. clock
avrebopti.menu.clock.12extclock.build.speed=12
avrebopti.menu.clock.12extclock.build.clocksource=2
avrebopti.menu.clock.10extclock=10 MHz ext. clock
avrebopti.menu.clock.10extclock.build.speed=0
avrebopti.menu.clock.10extclock.build.clocksource=2
#avrebopti.menu.clock.8extpll=8 MHz ext. clock w/32 Mhz PLL
#avrebopti.menu.clock.8extpll.build.speed=8
#avrebopti.menu.clock.8extpll.build.clocksource=10
avrebopti.menu.clock.8extclock=8 MHz ext. clock
avrebopti.menu.clock.8extclock.build.speed=8
avrebopti.menu.clock.8extclock.build.clocksource=2
avrebopti.menu.clock.32extclock=32 MHz ext. clock (unlikely-to-work overclocked)
avrebopti.menu.clock.32extclock.build.speed=32
avrebopti.menu.clock.32extclock.build.clocksource=2
#avrebopti.menu.clock.25extpll=25 MHz ext. clock w/100 Mhz PLL (overclocked)
#avrebopti.menu.clock.25extpll.build.speed=25
#avrebopti.menu.clock.25extpll.build.clocksource=10
avrebopti.menu.clock.25extclock=25 MHz ext. clock (overclocked)
avrebopti.menu.clock.25extclock.build.speed=25
avrebopti.menu.clock.25extclock.build.clocksource=2
#avrebopti.menu.clock.24extpll=24 MHz ext. clock w/96 Mhz PLL (overclocked)
#avrebopti.menu.clock.24extpll.build.speed=24
#avrebopti.menu.clock.24extpll.build.clocksource=10
avrebopti.menu.clock.24extclock=24 MHz ext. clock (overclocked)
avrebopti.menu.clock.24extclock.build.speed=24
avrebopti.menu.clock.24extclock.build.clocksource=2
#avrebopti.menu.clock.32extpll=32 MHz ext. clock w/128 Mhz PLL (unlikely-to-work overclocked)
#avrebopti.menu.clock.32extpll.build.speed=32
#avrebopti.menu.clock.32extpll.build.clocksource=10

#----------------------------------------#
# BrownOut detection (BOD) option        #
#________________________________________#
#    Completely speculative         #
#   Assumes same as Dx-series       #
#___________________________________#
avrebopti.menu.bodvoltage.1v75=1.75V (during programming only)
avrebopti.menu.bodvoltage.1v75.bootloader.bodlevbits=000
avrebopti.menu.bodvoltage.1v9=1.9V
avrebopti.menu.bodvoltage.1v9.bootloader.bodlevbits=001
avrebopti.menu.bodvoltage.2v6=2.60V
avrebopti.menu.bodvoltage.2v6.bootloader.bodlevbits=010
avrebopti.menu.bodvoltage.4v3=4.3V
avrebopti.menu.bodvoltage.4v3.bootloader.bodlevbits=011
avrebopti.menu.bodmode.disabled=Disabled/Disabled
avrebopti.menu.bodmode.enabled=Enabled/Enabled
avrebopti.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrebopti.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrebopti.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrebopti.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrebopti.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrebopti.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrebopti.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrebopti.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrebopti.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrebopti.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrebopti.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrebopti.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrebopti.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrebopti.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrebopti.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrebopti.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

