SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
avrebopti.menu.eesave.enableenable=EEPROM + BOOTROW retained
avrebopti.menu.eesave.enableenable.bootloader.eesavebit=1
avrebopti.menu.eesave.enableenable.bootloader.browsavebit=1
avrebopti.menu.eesave.enabledisable=EEPROM retained, BOOTROW not
avrebopti.menu.eesave.enabledisable.bootloader.eesavebit=1
avrebopti.menu.eesave.enabledisable.bootloader.browsavebit=0
avrebopti.menu.eesave.disableenable=BOOTROW retained, EEPROM not
avrebopti.menu.eesave.disableenable.bootloader.eesavebit=0
avrebopti.menu.eesave.disableenable.bootloader.browsavebit=1
avrebopti.menu.eesave.disabledisable=Neither retained
avrebopti.menu.eesave.disabledisable.bootloader.eesavebit=0
avrebopti.menu.eesave.disabledisable.bootloader.browsavebit=0


#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
avrebopti.menu.resetpin.reset=Hardware Reset (recommended)
avrebopti.menu.resetpin.reset.bootloader.resetpinbit=1
avrebopti.menu.resetpin.input=Input (no output, ever)
avrebopti.menu.resetpin.input.bootloader.resetpinbit=0

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrebopti.menu.millis.tcb1=TCB1 (recommended)
avrebopti.menu.millis.disabled=Disabled
avrebopti.menu.millis.tcb0=TCB0
#avrebopti.menu.millis.tce0=TCE0
#avrebopti.menu.millis.tcf3=TCF0
#avrebopti.menu.millis.rtc=RTC (no micros)
#avrebopti.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal, no micros
#avrebopti.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
avrebopti.menu.millis.tcb0.build.millistimer=B0
avrebopti.menu.millis.tcb1.build.millistimer=B1
#avrebopti.menu.millis.tce0.build.millistimer=E0
#avrebopti.menu.millis.tcf0.build.millistimer=F0
#avrebopti.menu.millis.rtc.build.millistimer=RTC
#avrebopti.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
#avrebopti.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avrebopti.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrebopti.menu.printf.default=Default, 1.5k flash, no floats
avrebopti.menu.printf.full=Full, 2.6k, prints floats
avrebopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrebopti.menu.printf.full.build.printfabr=.pfF
avrebopti.menu.printf.minimal=Minimal, 1.1k flash used
avrebopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrebopti.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#avrebopti.menu.optimization.size=-Os (size)
#avrebopti.menu.optimization.sizegcse=-Os (size, no GCSE)
#avrebopti.menu.optimization.o3=-O3 (speed)
#avrebopti.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#avrebopti.menu.optimization.size.build.optimizationlevel=-Os
#avrebopti.menu.optimization.sizegcse.build.optimizationlevel=-Os
#avrebopti.menu.optimization.o3.build.optimizationlevel=-O3
#avrebopti.menu.optimization.o3gcse.build.optimizationlevel=-O3
#avrebopti.menu.optimization.size.build.optabr=.Os
#avrebopti.menu.optimization.sizegcse.build.optabr=.Osng
#avrebopti.menu.optimization.o3.build.optabr=.O3
#avrebopti.menu.optimization.o3gcse.build.optabr=.O3ng
#avrebopti.menu.optimization.sizegcse.build.gcse=-fno-gcse
#avrebopti.menu.optimization.o3gcse.build.gcse=-fno-gcse


#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrebopti.menu.attach.allenabled=On all pins, with new implementation.
avrebopti.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrebopti.menu.attach.manual=Only enabled ports. Plebse see documentation.
avrebopti.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrebopti.menu.attach.oldversion=Old version, may fix bugs.
avrebopti.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrebopti.menu.attach.manual.build.attachabr=.aMan
avrebopti.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrebopti.menu.startuptime.8=8ms
avrebopti.menu.startuptime.0=0ms
avrebopti.menu.startuptime.1=1ms
avrebopti.menu.startuptime.2=2ms
avrebopti.menu.startuptime.4=4ms
avrebopti.menu.startuptime.16=16ms
avrebopti.menu.startuptime.32=32ms
avrebopti.menu.startuptime.64=64ms
avrebopti.menu.startuptime.0.bootloader.SYSCFG1=0x00
avrebopti.menu.startuptime.1.bootloader.SYSCFG1=0x01
avrebopti.menu.startuptime.2.bootloader.SYSCFG1=0x02
avrebopti.menu.startuptime.4.bootloader.SYSCFG1=0x03
avrebopti.menu.startuptime.8.bootloader.SYSCFG1=0x04
avrebopti.menu.startuptime.16.bootloader.SYSCFG1=0x05
avrebopti.menu.startuptime.32.bootloader.SYSCFG1=0x06
avrebopti.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrebopti.menu.wiremode.mors=1x Wire, Master or Slave
avrebopti.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrebopti.menu.wiremode.mors.build.wireabr=.wO
avrebopti.menu.wiremode.mands=1x Wire, Master and Slave
avrebopti.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrebopti.menu.wiremode.mands.build.wireabr=.wA

#-------------------------------------#
#         SPM from app mode           #
# To enable writing flash from app    #
#_____________________________________#
avrebopti.menu.appspm.no=Disabled (SPM write from app is not yet supported)
avrebopti.menu.appspm.no.bootloader.appspm=
avrebopti.menu.appspm.no.bootloader.BOOTSIZE=0x00
avrebopti.menu.appspm.no.build.appspmabr=
avrebopti.menu.appspm.full=
avrebopti.menu.appspm.full.bootloader.appspm=
avrebopti.menu.appspm.full.build.appspmabr=.spmINVALID
avrebopti.menu.appspm.full.bootloader.BOOTSIZE=0x00
#avrebopti.menu.appspm.full=Anywhere after 0x0200 (warning: App allowed to overwrite itself)
#avrebopti.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
#avrebopti.menu.appspm.full.build.appspmabr=.spmALL
#avrebopti.menu.appspm.8plus=Above 8k (meant for 16k parts)
#avrebopti.menu.appspm.8plus.bootloader.appspm=-DSPM_FROM_APP=32
#avrebopti.menu.appspm.8plus.bootloader.CODESIZE=32
#avrebopti.menu.appspm.12plus=Above 12k (meant for 16k parts)
#avrebopti.menu.appspm.12plus.bootloader.appspm=-DSPM_FROM_APP=48
#avrebopti.menu.appspm.12plus.bootloader.CODESIZE=48
#avrebopti.menu.appspm.14plus=Above 14k (meant for 16k parts)
#avrebopti.menu.appspm.14plus.bootloader.appspm=-DSPM_FROM_APP=56
#avrebopti.menu.appspm.14plus.bootloader.CODESIZE=56
#avrebopti.menu.appspm.16plus=Above 16k (AVR64/32 only, meant for 32k parts)
#avrebopti.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=64
#avrebopti.menu.appspm.16plus.bootloader.CODESIZE=64
#avrebopti.menu.appspm.24plus=Above 24k (AVR64/32 only, meant for 32k parts)
#avrebopti.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=96
#avrebopti.menu.appspm.24plus.bootloader.CODESIZE=96
#avrebopti.menu.appspm.28plus=Above 28k (AVR64/32 only, meant for 32k parts)
#avrebopti.menu.appspm.28plus.bootloader.appspm=-DSPM_FROM_APP=112
#avrebopti.menu.appspm.28plus.bootloader.CODESIZE=112

