SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrebopti.menu.WDTtimeout.disabled=Disabled (recommended)
avrebopti.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrebopti.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrebopti.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrebopti.menu.WDTtimeout.1second=Window remains open for 1 Second
avrebopti.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrebopti.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrebopti.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrebopti.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrebopti.menu.WDTwindow.disabled=No delay before window "opens"
avrebopti.menu.WDTwindow.8seconds=8 Second before window "opens"
avrebopti.menu.WDTwindow.4seconds=4 Second before window "opens"
avrebopti.menu.WDTwindow.2seconds=2 Second before window "opens"
avrebopti.menu.WDTwindow.1second=1 Second before window "opens"
avrebopti.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrebopti.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrebopti.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrebopti.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrebopti.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrebopti.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrebopti.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrebopti.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrebopti.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrebopti.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrebopti.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrebopti.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrebopti.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrebopti.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrebopti.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrebopti.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrebopti.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrebopti.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrebopti.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrebopti.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrebopti.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrebopti.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
avrebopti.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
avrebopti.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
avrebopti.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
avrebopti.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
avrebopti.menu.flmap.unlocked.build.flmapopts=
avrebopti.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
avrebopti.menu.flmap.lockdefault.build.flmapabr=.fld
avrebopti.menu.flmap.unlocked.build.flmapabr=.ful
avrebopti.menu.flmap.locksection0.build.flmapabr=.fl0




########################################################################################################
#                                                                                                      #
#  ###       ####                                                    ####  ####      //  ####   ####   #
# #   # #### #   # #   #  #  #  #  ###      #  #  ##  #  #  ###      #   # #   #    //   #   #  #   #  #
# #####   #  #   # #   #  #  ## # #   #     ## # #  # ## # #   #     #   # ####    //    #   #  #   #  #
# #   #  #   #   # #   #  #  # ## #   #     # ## #### # ## #   #     #   # #   #  //     #   #  #   #  #
# #   # #### ####   ###   #  #  #  ###      #  # #  # #  #  ###      ####  ####  //      ####   ####   #
#______________________________________________________________________________________________________#
#                                         #
# As well as other Azduino boards with    #
# features that alter what things make    #
# sensible defaults, ex, the port serial  #
# uploads occur on, whether crystal pins  #
# need to be disabled even if not using   #
# crystal because it's still hardwired to #
# one which would be destroyed if they    #
# were set as outputs. If you've modified #
# the board to change that, then you      #
# should be using the generic DB/DD board #
#_________________________________________#
azduinoboard.build.board=InvalidBoard
azduinoboard.build.mvioenable=-DMVIO_ENABLED
azduinoboard.build.core=dxcore
azduinoboard.upload.maximum_size=0
azduinoboard.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
azduinoboard.build.f_cpu={build.speed}000000L
azduinoboard.build.text_section_start=.text=0x200
azduinoboard.build.extra_flags=
azduinoboard.build.export_merged_output=true
azduinoboard.build.printf=
azduinoboard.build.flmapopts=
azduinoboard.build.attachmode=-DCORE_ATTACH_ALL
#-----------------------------------------#
# Bootloading parameters and fuses        #
#_________________________________________#
azduinoboard.bootloader.entrycond={bootloader.defaultentrycond}
azduinoboard.bootloader.defaulttimeout=
azduinoboard.bootloader.file={runtime.platform.path}/bootloaders/hex/{bootloader.class}.hex
azduinoboard.bootloader.muxnum=
azduinoboard.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
azduinoboard.bootloader.pymcuprogstring=-f "{bootloader.file}" -a write
azduinoboard.bootloader.tool=avrdude
# AVR Dx-series can only take either 1 (unsupported, 32 kHz, too slow for serial, and 1/30th of the minimum speed we support) or 0 (normal operation)
azduinoboard.bootloader.OSCCFG=0b00000000
azduinoboard.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
azduinoboard.bootloader.wdtwindowbits=0000
azduinoboard.bootloader.wdttimeotbits=0000
azduinoboard.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
azduinoboard.bootloader.SYSCFG0=0b1100{bootloader.resetpinbit}00
azduinoboard.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
azduinoboard.bootloader.CODESIZE=0x00
azduinoboard.bootloader.BOOTSIZE=0x01

#-----------------------------------------#
# Upload parameters for Optiboot          #
#_________________________________________#
azduinoboard.upload.tool=avrdude
azduinoboard.upload.protocol=arduino
azduinoboard.upload.extra_params=-D
azduinoboard.upload.speed=115200
azduinoboard.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"

